{
  "locale": "pl",
  "translations": {
    "668355912565392700": "O {$START_TAG_SPAN}mnie{$CLOSE_TAG_SPAN}",
    "6544916143469665114": "Jako programista, moja podróż rozpoczęła się od ciekawości eksploracji cyfrowego świata, bawienia się podstawowymi koncepcjami kodowania i odkrywania radości przynoszonej przez tworzenie oprogramowania. Z czasem moja pasja do programowania ewoluowała w pełnoprawną karierę, charakteryzującą się ciągłym uczeniem się i dążeniem do przekraczania granic możliwości w dziedzinie technologii.",
    "3567417853671291476": "Poza liniami kodu, znajduję inspirację w różnorodnych zainteresowaniach. Od zagłębiania się w złożoności sztucznej inteligencji i uczenia maszynowego, po eksplorację głębi wizualizacji danych i projektowania doświadczeń użytkownika, ciągle poszukuję nowych dróg, aby poszerzyć horyzonty i innowować w nieustannie ewoluującym świecie technologii.",
    "8807499540389103708": "Technologie:",
    "6709320430327029754": "Moje Portfolio",
    "5866254605255506989": "angielski",
    "792060551707690640": "polski",
    "1348774649041038169": "Nawigacja",
    "1726363342938046830": "O mnie",
    "3398353192845179101": "Doświadczenie",
    "7922989125096435449": "Kontakt",
    "550814173601682959": "Wersje językowe dostępne tylko w buildzie produkcyjnym (kliknij po więcej informacji)",
    "8953033926734869941": "Imię",
    "2045112409653231798": "Nazwisko",
    "9127604588498960753": "Temat",
    "1157630416437993334": "Treść",
    "4771399934396724309": "Wyślij!",
    "1353758708661564280": "Wiadomość wysłano pomyślnie!",
    "3341308394215401960": "Zobacz wysłane dane",
    "7478678459216721624": "Twoje dane wiadomości:",
    "7819314041543176992": "Close",
    "1660610601411009877": "Piotr Przetacki © 2024 | Stworzone przy użyciu {$START_LINK}Angulara{$CLOSE_LINK}",
    "8953638170877677207": "Cześć, nazywam się",
    "6977727850995598526": "Tworzę nowoczesne aplikacje webowe.",
    "187187500641108332": "{$INTERPOLATION}",
    "4849789319236309858": "Skontaktuj się!",
    "1957460586682822384": "Tworzenie porywających interfejsów użytkownika to moje specjalność. Dzięki połączeniu kreatywności z techniczną precyzją, przekształcam projekty w zanurzające cyfrowe doznania. Wspólnie podbijmy Twoją obecność w sieci.",
    "7971963968574813125": "Moje {$START_TAG_SPAN}doświadczenie{$CLOSE_TAG_SPAN}",
    "5531195057010443196": "UI Engeneer - Ipsum Sp. z o. o.",
    "8051562523141988221": "Wrz 2021 - 2024",
    "6376781042190113204": "Jako inżynier UI, skupiałem się na projektowaniu i tworzeniu intuicyjnych interfejsów użytkownika dla aplikacji internetowych, zapewniając płynne doświadczenia użytkownika oraz ściśle współpracując z projektantami UX w celu implementacji atrakcyjnych wizualnie projektów.",
    "1327001720648481777": "Software developer - Dolor Sit",
    "4913484460454724031": "Gru 2019 - Wrz 2021",
    "6776344327390309783": "Jako Software developer w firmie Dolor Sit, przyczyniałem się do rozwoju i utrzymania rozwiązań programowych, współpracując z zespołami wielodyscyplinarnymi w celu dostarczenia wysokiej jakości produktów w określonych terminach.",
    "1945447147742464187": "Frontend Engeneer - Loprem Sp. z o. o.",
    "5513894230007552358": "Cze 2019 - Paź 2021",
    "8268523816910004877": "Jako Inżynier Frontend specjalizujący się w Angularze, projektowałem i wdrażałem responsywne interfejsy użytkownika, wykorzystując framework Angular do tworzenia dynamicznych i interaktywnych aplikacji internetowych.",
    "1370524685579849745": "I18n niedostępna w dev modzie",
    "4446989176477935350": "Pakiet {$START_TAG_CODE}angular/localize{$CLOSE_TAG_CODE} potrafi jedynie budować strony w każdej z podanych wersji językowych do katalogu {$START_TAG_CODE}/dist{$CLOSE_TAG_CODE} przy użyciu polecenia {$START_TAG_CODE}ng build --localize{$CLOSE_TAG_CODE}. Aby różne wersje językowe były dostępne należy skonfigurować serwer tak, aby odpowiednie katalogi np. 'en' lub 'pl' były serwowane jako {$START_TAG_CODE}host.com/en{$CLOSE_TAG_CODE} i {$START_TAG_CODE}host.com/en.{$CLOSE_TAG_CODE}"
  }
}
